Revit 2027 API
ParameterTypeId.PlanViewNorth Property
 "Orientation"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId PlanViewNorth { get; }
Public Shared ReadOnly Property PlanViewNorth As ForgeTypeId
	Get
public:
static property ForgeTypeId^ PlanViewNorth {
	ForgeTypeId^ get ();
}
static member PlanViewNorth : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace